<?php return array (
  'public' => 
  array (
    'retrieved' => 'تم استرداد البيانات بنجاح.',
    'stored' => 'تم تخزين العنصر بنجاح.',
    'deleted' => 'تمت إزالة العنصر بنجاح.',
    'updated' => 'تم تحديث العنصر بنجاح.',
    'status' => ':البند :الحالة بنجاح.',
    'invalid' => 'لم يتم العثور على العنصر!',
  ),
  'auth' => 
  array (
    'not_verified' => 'لم يتم التحقق من المستخدم.',
    'not_found' => 'لم يتم العثور على المستخدم.',
    'invalid_register_method' => 'طريقة التسجيل غير صالحة.',
    'already_registered' => 'تم تسجيل المستخدم بالفعل.',
    'login' => 'قام المستخدم بتسجيل الدخول بنجاح.',
    'registered' => 'تم تسجيل المستخدم بنجاح.',
  ),
  'not_access_to_this_item' => 'ليس لديك حق الوصول إلى هذا العنصر.',
);