@extends('landing_v1.layouts.app')

@section('content')
@php($landingImg = asset('assets/landing_v1/img/instructors'))
<main>
    <x-landing_v1::page-hero image="{{ asset('assets/landing_v1/img/contact/hero.webp') }}"
        title="نخبة الخبراء.. شركاء نجاحك" :breadcrumbs="[
            ['label' => 'الرئيسية', 'href' => route('landing.v1.index')],
            ['label' => 'المدربين', 'href' => route('landing.v1.instructors')],
        ]" />

    <section class="section-gap">
        <div class="container">
            <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-4 lg:gap-x-10 lg:gap-y-13 ">

                @foreach($instructors as $instructor)
                <div class="border border-[#CFCFCF] rounded-9px overflow-hidden flex flex-col">
                    <a href="{{ $instructor->getProfileUrl() }}" class="block mb-4 bg-e3 aspect-[4/3] overflow-hidden">
                        <img src="{{ $instructor->getAvatar() }}" alt="{{ $instructor->full_name }}"
                            class="w-full h-full object-contain">
                    </a>
                    <div class="p-5 mb-6 flex-1 flex flex-col">
                        <a href="{{ $instructor->getProfileUrl() }}">
                            <h6
                                class="font-semibold text-24px text-primary mb-2 hover:text-secondary transition-colors">
                                {{ $instructor->full_name }}</h6>
                        </a>
                        <p class="font-normal text-base text-primary leading-6 mb-6">
                            {{ $instructor->bio }}
                        </p>

                        <div class="flex justify-between items-center lg:gap-4 xl:gap-9 flex-wrap mb-7 mt-auto">
                            <div class="flex items-center gap-2">
                                <svg width="18" height="18" viewBox="0 0 18 18" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                        d="M4.79083 0C4.95659 0 5.11557 0.065848 5.23278 0.183058C5.34999 0.300269 5.41583 0.45924 5.41583 0.625V1.26083C5.9675 1.25 6.575 1.25 7.24333 1.25H10.6708C11.34 1.25 11.9475 1.25 12.4992 1.26083V0.625C12.4992 0.45924 12.565 0.300269 12.6822 0.183058C12.7994 0.065848 12.9584 0 13.1242 0C13.2899 0 13.4489 0.065848 13.5661 0.183058C13.6833 0.300269 13.7492 0.45924 13.7492 0.625V1.31417C13.9658 1.33083 14.1711 1.35194 14.365 1.3775C15.3417 1.50917 16.1325 1.78583 16.7567 2.40917C17.38 3.03333 17.6567 3.82417 17.7883 4.80083C17.9158 5.75083 17.9158 6.96333 17.9158 8.495V10.255C17.9158 11.7867 17.9158 13 17.7883 13.9492C17.6567 14.9258 17.38 15.7167 16.7567 16.3408C16.1325 16.9642 15.3417 17.2408 14.365 17.3725C13.415 17.5 12.2025 17.5 10.6708 17.5H7.245C5.71333 17.5 4.5 17.5 3.55083 17.3725C2.57417 17.2408 1.78333 16.9642 1.15917 16.3408C0.535833 15.7167 0.259167 14.9258 0.1275 13.9492C0 12.9992 0 11.7867 0 10.255V8.495C0 6.96333 0 5.75 0.1275 4.80083C0.259167 3.82417 0.535833 3.03333 1.15917 2.40917C1.78333 1.78583 2.57417 1.50917 3.55083 1.3775C3.74528 1.35194 3.95056 1.33083 4.16667 1.31417V0.625C4.16667 0.459384 4.2324 0.300539 4.34943 0.183353C4.46646 0.0661663 4.62522 0.000220821 4.79083 0ZM3.71583 2.61667C2.87833 2.72917 2.395 2.94083 2.0425 3.29333C1.69 3.64583 1.47833 4.12917 1.36583 4.96667C1.34694 5.10833 1.33083 5.25806 1.3175 5.41583H16.5975C16.5842 5.25806 16.5681 5.10806 16.5492 4.96583C16.4367 4.12833 16.225 3.645 15.8725 3.2925C15.52 2.94 15.0367 2.72833 14.1983 2.61583C13.3425 2.50083 12.2133 2.49917 10.6242 2.49917H7.29083C5.70167 2.49917 4.57333 2.50167 3.71583 2.61667ZM1.24917 8.54167C1.24917 7.83 1.24917 7.21083 1.26 6.66667H16.655C16.6658 7.21083 16.6658 7.83 16.6658 8.54167V10.2083C16.6658 11.7975 16.6642 12.9267 16.5492 13.7833C16.4367 14.6208 16.225 15.1042 15.8725 15.4567C15.52 15.8092 15.0367 16.0208 14.1983 16.1333C13.3425 16.2483 12.2133 16.25 10.6242 16.25H7.29083C5.70167 16.25 4.57333 16.2483 3.71583 16.1333C2.87833 16.0208 2.395 15.8092 2.0425 15.4567C1.69 15.1042 1.47833 14.6208 1.36583 13.7825C1.25083 12.9267 1.24917 11.7975 1.24917 10.2083V8.54167Z"
                                        fill="#A6AAB5" />
                                </svg>

                                <div class="font-medium text-10px flex flex-col   text-[#A6AAB5]">
                                    <span>عضو منذ</span>
                                    <span>{{ $instructor->created_at ? dateTimeFormat($instructor->created_at, 'Y') :
                                        '0' }}</span>
                                </div>
                            </div>

                            <div class="flex items-center gap-2">
                                <svg width="20" height="20" viewBox="0 0 20 20" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M4.0625 2.5C3.31658 2.5 2.60121 2.79632 2.07376 3.32376C1.54632 3.85121 1.25 4.56658 1.25 5.3125V14.6875C1.25 15.4334 1.54632 16.1488 2.07376 16.6762C2.60121 17.2037 3.31658 17.5 4.0625 17.5H15.9375C16.6834 17.5 17.3988 17.2037 17.9262 16.6762C18.4537 16.1488 18.75 15.4334 18.75 14.6875V5.3125C18.75 4.56658 18.4537 3.85121 17.9262 3.32376C17.3988 2.79632 16.6834 2.5 15.9375 2.5H4.0625ZM2.5 5.3125C2.5 4.8981 2.66462 4.50067 2.95765 4.20765C3.25067 3.91462 3.6481 3.75 4.0625 3.75H15.9375C16.3519 3.75 16.7493 3.91462 17.0424 4.20765C17.3354 4.50067 17.5 4.8981 17.5 5.3125V14.6875C17.5 15.1019 17.3354 15.4993 17.0424 15.7924C16.7493 16.0854 16.3519 16.25 15.9375 16.25H4.0625C3.6481 16.25 3.25067 16.0854 2.95765 15.7924C2.66462 15.4993 2.5 15.1019 2.5 14.6875V5.3125ZM7.5 7.50063V12.5C7.50007 12.6079 7.52805 12.7139 7.58123 12.8077C7.6344 12.9015 7.71095 12.98 7.80344 13.0355C7.89593 13.091 8.0012 13.1216 8.10902 13.1244C8.21685 13.1271 8.32355 13.1019 8.41875 13.0513L13.105 10.5519C13.2048 10.4985 13.2883 10.4191 13.3465 10.322C13.4047 10.2249 13.4355 10.1138 13.4355 10.0006C13.4355 9.88743 13.4047 9.77635 13.3465 9.67927C13.2883 9.58218 13.2048 9.50272 13.105 9.44938L8.41937 6.94938C8.32411 6.89851 8.21728 6.87319 8.10932 6.87591C8.00135 6.87861 7.89593 6.90926 7.80333 6.96484C7.71074 7.02042 7.63412 7.09905 7.58096 7.19306C7.5278 7.28707 7.49991 7.39263 7.5 7.50063Z"
                                        fill="#A6AAB5" />
                                </svg>


                                <div class="font-medium text-10px flex flex-col   text-[#A6AAB5]">
                                    <span>دورات</span>
                                    <span>{{ $instructor->courses_count ?? '0' }}</span>
                                </div>
                            </div>


                            <div class="flex items-center gap-2">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M18 13.5C15.519 13.5 13.5 15.5182 13.5 18C13.5 20.4818 15.519 22.5 18 22.5C20.481 22.5 22.5 20.4818 22.5 18C22.5 15.5182 20.481 13.5 18 13.5ZM18 21C16.3455 21 15 19.6545 15 18C15 16.3455 16.3455 15 18 15V18H21C21 19.6545 19.6545 21 18 21Z"
                                        fill="#A6AAB5" />
                                    <path
                                        d="M12 21H6.75V6H17.25V11.25H18.75V3C18.75 2.17275 18.0773 1.5 17.25 1.5H6.75C5.92275 1.5 5.25 2.17275 5.25 3V21C5.25 21.8272 5.92275 22.5 6.75 22.5H12V21ZM6.75 3H17.25V4.5H6.75V3Z"
                                        fill="#A6AAB5" />
                                </svg>



                                <div class="font-medium text-10px flex flex-col   text-[#A6AAB5]">
                                    <span>استشارات</span>
                                    <span>0</span>
                                </div>
                            </div>

                            <div class="flex items-center gap-2">
                                <svg width="21" height="20" viewBox="0 0 21 20" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M18.5 15C19.0304 15 19.5391 14.7893 19.9142 14.4142C20.2893 14.0391 20.5 13.5304 20.5 13V2C20.5 1.46957 20.2893 0.960859 19.9142 0.585786C19.5391 0.210714 19.0304 0 18.5 0H7.96C8.31 0.61 8.5 1.3 8.5 2H18.5V13H9.5V15M13.5 5V7H7.5V20H5.5V14H3.5V20H1.5V12H0V7C0 6.46957 0.210714 5.96086 0.585786 5.58579C0.960859 5.21071 1.46957 5 2 5H13.5ZM6.5 2C6.5 2.53043 6.28929 3.03914 5.91421 3.41421C5.53914 3.78929 5.03043 4 4.5 4C3.96957 4 3.46086 3.78929 3.08579 3.41421C2.71071 3.03914 2.5 2.53043 2.5 2C2.5 1.46957 2.71071 0.960859 3.08579 0.585786C3.46086 0.210714 3.96957 0 4.5 0C5.03043 0 5.53914 0.210714 5.91421 0.585786C6.28929 0.960859 6.5 1.46957 6.5 2Z"
                                        fill="#A6AAB5" />
                                </svg>


                                <div class="font-medium text-10px flex flex-col   text-[#A6AAB5]">
                                    <span>طلاب</span>
                                    <span>{{ $instructor->students_count ?? '0' }}</span>
                                </div>
                            </div>
                        </div>

                        <div>
                            <a href="{{ $instructor->getProfileUrl() }}"
                                class="btn btn-primary h-13 rounded-4px font-medium text-14px btn-block">
                                <svg width="19" height="19" viewBox="0 0 19 19" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M9.08333 0.75C4.48083 0.75 0.75 4.48083 0.75 9.08333C0.75 13.6858 4.48083 17.4167 9.08333 17.4167C13.6858 17.4167 17.4167 13.6858 17.4167 9.08333C17.4167 4.48083 13.6858 0.75 9.08333 0.75Z"
                                        stroke="white" stroke-width="1.5" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                    <path
                                        d="M2.64258 14.3704C2.64258 14.3704 4.50008 11.9987 9.08341 11.9987C13.6667 11.9987 15.5251 14.3704 15.5251 14.3704M9.08341 9.08203C9.74645 9.08203 10.3823 8.81864 10.8512 8.3498C11.32 7.88096 11.5834 7.24507 11.5834 6.58203C11.5834 5.91899 11.32 5.28311 10.8512 4.81426C10.3823 4.34542 9.74645 4.08203 9.08341 4.08203C8.42037 4.08203 7.78449 4.34542 7.31564 4.81426C6.8468 5.28311 6.58341 5.91899 6.58341 6.58203C6.58341 7.24507 6.8468 7.88096 7.31564 8.3498C7.78449 8.81864 8.42037 9.08203 9.08341 9.08203Z"
                                        stroke="white" stroke-width="1.5" stroke-linecap="round"
                                        stroke-linejoin="round" />
                                </svg>

                                عرض الملف الشخصي

                            </a>
                        </div>
                    </div>

                </div>
                @endforeach

            </div>
    </section>


         <section class="section-gap ">
            <div class="container  ">
                <div class="bg-gold rounded-8px py-16 center flex-col text-center space-y-5">
                    <h2 class="font-bold text-56px text-white">كفاءات وطنية تقود التغيير المؤسسي</h2>
                    <p class="font-medium text-22px text-white">
                        نخبة من المستشارين والممارسين المعتمدين جاهزون لتطوير مهارات فريقك وبناء استراتيجيات نجاح منشأتك.
                    </p>
                    <a href="{{ route('landing.v1.register') }}"
                        class="btn btn-primary h-13 rounded-2px px-11 text-white font-medium text-14px">
                        سجل الآن
                        <span class="icon icon-[tabler--arrow-left]"></span>
                    </a>
                </div>
            </div>

        </section>

</main>
@endsection
@push('scripts')


@endpush
